backend-master/tests/load_tests/artillery_t2.yml
config:
  # Testing all the api endpoints for ECOM_Backend
  target: http://localhost:3000/
  phases:
    - duration: 60
      arrivalRate: 1
      rampTo: 5
      name: Warm up phase
    - duration: 60
      arrivalRate: 5
      rampTo: 10
      name: Ramp up load
    - duration: 30
      arrivalRate: 10
      rampTo: 30
      name: Spike phase
# Plugins
  plugins:
    ensure: {}
    apdex: {}
    metrics-by-endpoint: {}
  apdex:
    threshold: 100
  ensure:
      thresholds:
        - http.response_time.p99: 100
        - http.response_time.p95: 75
scenarios:
  - flow:
      - loop:
        - get:
            url: "/api"
        - get:
            url: "/api/viewAllProducts"
        - post:
            url: "/api/deleteProduct"
        - post:
            url: "/api/updateProduct"
        - post:
            url: "/api/searchProduct"
        - post:
            url: "/api/uploadImages"
        - post:
            url: "/api/addProduct"
        count: 100